1) /var/www/html/app/Http/Controllers/ScoreController.php:10    [M] PublicVisibility

--- Original
+++ New
@@ @@
 use Illuminate\Http\Request;
 class ScoreController extends Controller
 {
-    public function index(Request $request) : JsonResponse
+    protected function index(Request $request) : JsonResponse
     {
         $this->validate($request, ['points' => 'required|int']);
         //        $score = match ((int) $request->get('points')) {

2) /var/www/html/app/Http/Controllers/ScoreController.php:12    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 {
     public function index(Request $request) : JsonResponse
     {
-        $this->validate($request, ['points' => 'required|int']);
+        $this->validate($request, []);
         //        $score = match ((int) $request->get('points')) {
         //            107     => 300,
         //            default => $request->get('points') * 2

3) /var/www/html/app/Http/Controllers/ScoreController.php:12    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
 {
     public function index(Request $request) : JsonResponse
     {
-        $this->validate($request, ['points' => 'required|int']);
+        
         //        $score = match ((int) $request->get('points')) {
         //            107     => 300,
         //            default => $request->get('points') * 2

4) /var/www/html/app/Http/Controllers/ScoreController.php:19    [M] DecrementInteger

--- Original
+++ New
@@ @@
         //            107     => 300,
         //            default => $request->get('points') * 2
         //        };
-        $score = $request->get('points') * 2;
+        $score = $request->get('points') * 1;
         return response()->json(compact('score'), JsonResponse::HTTP_OK);
     }
 }

5) /var/www/html/app/Http/Controllers/ScoreController.php:19    [M] IncrementInteger

--- Original
+++ New
@@ @@
         //            107     => 300,
         //            default => $request->get('points') * 2
         //        };
-        $score = $request->get('points') * 2;
+        $score = $request->get('points') * 3;
         return response()->json(compact('score'), JsonResponse::HTTP_OK);
     }
 }

6) /var/www/html/app/Http/Controllers/ScoreController.php:19    [M] Multiplication

--- Original
+++ New
@@ @@
         //            107     => 300,
         //            default => $request->get('points') * 2
         //        };
-        $score = $request->get('points') * 2;
+        $score = $request->get('points') / 2;
         return response()->json(compact('score'), JsonResponse::HTTP_OK);
     }
 }


Timed Out mutants:
==================
